{
    "comment": "Next.jsの設定ファイル",
    "environment": {
        "comment": "本番環境は'production'、開発環境は'development'",
        "value": "production"
    },
    "backend": {
        "comment": "バックエンドと接続するための設定",
        "url": {
            "comment": "バックエンドのURL",
            "production": "https://kjyvczkxiucwrrbvhiiiajqyre0tmosf.lambda-url.ap-northeast-1.on.aws",
            "development": "http://localhost:5050"
        }
    },
    "metadata": {
        "comment": "HTMLのメタデータの設定",
        "title": "EmoMeter_感情測定アプリ",
        "description": "EmoMeterはあなたの文章を解析し、嬉しい・怒り・悲しい・楽しいの4つの感情のうち、どれが多く占めているかを測定します。SNS投稿前に感情のバランスをチェックし、より良いコミュニケーションを目指しましょう。"
    },
    "localStrage": {
        "comment": "ローカルストレージの設定",
        "prefix": "hFzcg4gu6hHDN15m0q6c"
    },
    "page": {
        "comment": "ページの設定",
        "common": {
            "comment": "ページを跨いで使用する設定",
            "keywords": [
                {
                    "keyword": "嬉しい",
                    "color": "#00e676",
                    "msgs": [
                        "あなたの文章は明るい光に満ちています。この前向きなエネルギーを保ち、ポジティブなコミュニケーションを続けましょう。",
                        "元気と活力が感じられる文章です。この好循環を維持し、周囲にもその明るさを分けてあげてください。",
                        "幸せが溢れる文章からは、内面の光が見えます。この幸せをさらに多くの瞬間に拡げ、素敵な経験をしましょう。",
                        "ポジティブな感情が際立つ文章です。この嬉しい気持ちを他人と共有することで、周りも明るくなります。",
                        "明朗な気持ちが伝わってきます。その明るさで、毎日をもっと輝かせましょう。"
                    ]
                },
                {
                    "keyword": "怒り",
                    "color": "#ff1744",
                    "msgs": [
                        "あなたの文章には怒りが見て取れます。一息ついて、冷静なコミュニケーションへと心を切り替えましょう。",
                        "不満や憤りが伝わってきます。この感情を上手に表現し、建設的な対話に繋げることが大切です。",
                        "イライラが感じられますね。深呼吸して、心を落ち着かせる方法を見つけ、穏やかな解決策を探しましょう。",
                        "怒りの感情が強いですね。しかし、そのエネルギーを正しい方向に使うことで、大きな変化を起こせるかもしれません。",
                        "感情が高ぶっている様子です。少し時間を置き、冷静になってから再度状況を見直しましょう。"
                    ]
                },
                {
                    "keyword": "悲しい",
                    "color": "#00b0ff",
                    "msgs": [
                        "あなたの文章からは寂しさや悲しみが伝わってきます。感情を共有し、支え合うことで、心のバランスを取り戻しましょう。",
                        "深い寂しさがありますね。友人や家族と時間を共有し、心の安らぎを見つけましょう。",
                        "悲しみが心を重くしているようです。自分の感情を大切にし、ゆっくりと立ち直りの道を歩んでください。",
                        "失望や悲哀を感じているようです。この感情はやがて過ぎ去ります。自分を信じ、時間をかけて癒やしましょう。",
                        "心が痛む出来事があったようですね。周りの支援を受け入れ、共感と理解の中で徐々に回復を目指しましょう。"
                    ]
                },
                {
                    "keyword": "楽しい",
                    "color": "#ffea00",
                    "msgs": [
                        "文章からは喜びと楽しさが溢れています。この陽気な気持ちを大切にしながら、楽しくコミュニケーションを続けましょう。",
                        "心が弾むような楽しさがありますね。このエネルギーを活かして、新しいことに挑戦してみてはいかがでしょうか。",
                        "幸せが心を満たしているようです。この幸福感を維持しつつ、さらに多くの楽しい瞬間を追求しましょう。",
                        "このままのハイスピリットで、日々を楽しみながら、人生を豊かにしていきましょう。",
                        "あなたの楽しい気持ちは周りにも伝わります。そのポジティブなオーラで、他の人も幸せにしてあげてください。"
                    ]
                }
            ]
        },
        "sentence": {
            "comment": "sentenceページの設定",
            "extensions": [
                "docx",
                "odt",
                "pdf",
                "txt",
                "epub",
                "html"
            ],
            "maxFileSize": 10485760,
            "maxWordCount": 15000,
            "examples": [
                "朝、鳥のさえずりに目覚め、窓から差し込む柔らかな日差しに嬉しさを感じました。しかし、通勤中の電車の遅延には少しイライラしました。職場での重要な会議が予想外にうまくいかず、悲しみがこみ上げてきましたが、昼休みに同僚と共に楽しいランチを過ごし、心が和みました。夕方、仕事の成果が認められた時の達成感は、一日の疲れを忘れさせてくれました。",
                "今朝は好きなコーヒーがなくなっていて、一日のスタートに怒りを感じました。しかし、通勤途中で子どもたちの楽しい笑い声を聞いて、心が明るくなりました。仕事中には予期せぬトラブルに直面し、少し悲しくなりましたが、同僚の協力で乗り越えたときの嬉しさは格別でした。夜は、家族と過ごす楽しい時間で一日の疲れを癒しました。",
                "今日は朝から気になる本が見つかり、嬉しく思いました。しかし、通勤ラッシュの中での人の多さに苛立ちを感じました。仕事では重要なプロジェクトに手こずり、悲しみに暮れる瞬間もありましたが、夜に友人との楽しいディナーが待っており、その思い出に浸りながら、一日の終わりを迎えました。",
                "今朝、好きなコーヒーショップで新しい味に出会い、その嬉しさで一日が始まりました。しかし、通勤途中で不快な出来事に遭遇し、怒りを感じました。昼には、大切なプレゼンが上手くいかず、悲しさがこみ上げましたが、夕方になって同僚との楽しいディナーパーティで笑いと共に心が癒されました。夜、一日の感情の起伏に思いを馳せながら、充実感を感じて眠りにつきました。"
            ]
        }
    }
}